; domain
(define (domain rover)
(:requirements :typing)
(:types 	rover waypoint store camera mode lander objective - object
)

(:predicates (at ?x - rover ?y - waypoint)
	(at_lander ?x - lander ?y - waypoint)
	(can_traverse ?r - rover ?x - waypoint ?y - waypoint)
	(equipped_for_soil_analysis ?r - rover)
	(equipped_for_rock_analysis ?r - rover)
	(equipped_for_imaging ?r - rover)
	(empty ?s - store)
	(have_rock_analysis ?r - rover ?w - waypoint)
	(have_soil_analysis ?r - rover ?w - waypoint)
	(full ?s - store)
	(calibrated ?c - camera ?r - rover)
	(supports ?c - camera ?m - mode)
	(available ?r - rover)
	(visible ?w - waypoint ?p - waypoint)
	(have_image ?r - rover ?o - objective ?m - mode)
	(communicated_soil_data ?w - waypoint)
	(communicated_rock_data ?w - waypoint)
	(communicated_image_data ?o - objective ?m - mode)
	(at_soil_sample ?w - waypoint)
	(at_rock_sample ?w - waypoint)
	(visible_from ?o - objective ?w - waypoint)
	(store_of ?s - store ?r - rover)
	(calibration_target ?i - camera ?o - objective)
	(on_board ?i - camera ?r - rover)
	(channel_free ?l - lander)
)

(:action navigate
	:parameters   (?x - rover ?y - waypoint ?z - waypoint)
	:precondition (and (visible ?y ?z) (can_traverse ?x ?y ?z) (available ?x) (at ?x ?y))
	:effect       (and (at ?x ?z) (not (at ?x ?y))
))

(:action sample_soil
	:parameters   (?x - rover ?s - store ?p - waypoint)
	:precondition (and (store_of ?s ?x) (equipped_for_soil_analysis ?x) (at ?x ?p) (empty ?s) (at_soil_sample ?p))
	:effect       (and (have_soil_analysis ?x ?p) (full ?s) (not (empty ?s)) (not (at_soil_sample ?p))
))

(:action sample_rock
	:parameters   (?x - rover ?s - store ?p - waypoint)
	:precondition (and (store_of ?s ?x) (at ?x ?p) (empty ?s) (equipped_for_rock_analysis ?x) (at_rock_sample ?p))
	:effect       (and (have_rock_analysis ?x ?p) (full ?s) (not (empty ?s)) (not (at_rock_sample ?p))
))

(:action drop
	:parameters   (?x - rover ?y - store)
	:precondition (and (store_of ?y ?x) (full ?y))
	:effect       (and (empty ?y) (not (full ?y))
))

(:action calibrate
	:parameters   (?r - rover ?i - camera ?t - objective ?w - waypoint)
	:precondition (and (calibration_target ?i ?t) (visible_from ?t ?w) (on_board ?i ?r) (equipped_for_imaging ?r) (at ?r ?w))
	:effect       (and (calibrated ?i ?r)
))

(:action take_image
	:parameters   (?r - rover ?p - waypoint ?o - objective ?i - camera ?m - mode)
	:precondition (and (at ?r ?p) (supports ?i ?m) (on_board ?i ?r) (equipped_for_imaging ?r) (calibrated ?i ?r) (visible_from ?o ?p))
	:effect       (and (have_image ?r ?o ?m) (not (calibrated ?i ?r))
))

(:action communicate_soil_data
	:parameters   (?r - rover ?l - lander ?p - waypoint ?x - waypoint ?y - waypoint)
	:precondition (and (available ?r) (have_soil_analysis ?r ?p) (channel_free ?l) (visible ?x ?y) (at ?r ?x) (at_lander ?l ?y))
	:effect       (and (communicated_soil_data ?p)
))

(:action communicate_rock_data
	:parameters   (?r - rover ?l - lander ?p - waypoint ?x - waypoint ?y - waypoint)
	:precondition (and (available ?r) (channel_free ?l) (visible ?x ?y) (have_rock_analysis ?r ?p) (at ?r ?x) (at_lander ?l ?y))
	:effect       (and (communicated_rock_data ?p)
))

(:action communicate_image_data
	:parameters   (?r - rover ?l - lander ?o - objective ?m - mode ?x - waypoint ?y - waypoint)
	:precondition (and (available ?r) (have_image ?r ?o ?m) (channel_free ?l) (visible ?x ?y) (at ?r ?x) (at_lander ?l ?y))
	:effect       (and (communicated_image_data ?o ?m)
))
)

; problem
(define (problem prb-293_d20_p-TR3-n35-r1w10o10c9-4) (:domain Rover)
(:objects
	general - Lander
	colour high_res low_res - Mode
	rover0 - Rover
	rover0store - Store
	waypoint0 waypoint1 waypoint2 waypoint3 waypoint4 waypoint5 waypoint6 waypoint7 waypoint8 waypoint9 - Waypoint
	camera0 camera1 camera2 camera3 camera4 camera5 camera6 camera7 camera8 - Camera
	objective0 objective1 objective2 objective3 objective4 objective5 objective6 objective7 objective8 objective9 - Objective
	)
(:init
(visible waypoint0 waypoint2)
(visible waypoint2 waypoint0)
(visible waypoint0 waypoint5)
(visible waypoint5 waypoint0)
(visible waypoint1 waypoint2)
(visible waypoint2 waypoint1)
(visible waypoint1 waypoint3)
(visible waypoint3 waypoint1)
(visible waypoint2 waypoint3)
(visible waypoint3 waypoint2)
(visible waypoint2 waypoint6)
(visible waypoint6 waypoint2)
(visible waypoint3 waypoint6)
(visible waypoint6 waypoint3)
(visible waypoint4 waypoint0)
(visible waypoint0 waypoint4)
(visible waypoint4 waypoint2)
(visible waypoint2 waypoint4)
(visible waypoint4 waypoint6)
(visible waypoint6 waypoint4)
(visible waypoint4 waypoint8)
(visible waypoint8 waypoint4)
(visible waypoint5 waypoint1)
(visible waypoint1 waypoint5)
(visible waypoint5 waypoint2)
(visible waypoint2 waypoint5)
(visible waypoint5 waypoint3)
(visible waypoint3 waypoint5)
(visible waypoint5 waypoint4)
(visible waypoint4 waypoint5)
(visible waypoint5 waypoint6)
(visible waypoint6 waypoint5)
(visible waypoint6 waypoint0)
(visible waypoint0 waypoint6)
(visible waypoint6 waypoint7)
(visible waypoint7 waypoint6)
(visible waypoint7 waypoint0)
(visible waypoint0 waypoint7)
(visible waypoint7 waypoint5)
(visible waypoint5 waypoint7)
(visible waypoint7 waypoint8)
(visible waypoint8 waypoint7)
(visible waypoint7 waypoint9)
(visible waypoint9 waypoint7)
(visible waypoint8 waypoint1)
(visible waypoint1 waypoint8)
(visible waypoint8 waypoint2)
(visible waypoint2 waypoint8)
(visible waypoint8 waypoint6)
(visible waypoint6 waypoint8)
(visible waypoint9 waypoint1)
(visible waypoint1 waypoint9)
(visible waypoint9 waypoint2)
(visible waypoint2 waypoint9)
(visible waypoint9 waypoint3)
(visible waypoint3 waypoint9)
(visible waypoint9 waypoint6)
(visible waypoint6 waypoint9)
(at_lander general waypoint5)
(store_of rover0store rover0)
(equipped_for_rock_analysis rover0)
(equipped_for_imaging rover0)
(can_traverse rover0 waypoint4 waypoint0)
(can_traverse rover0 waypoint0 waypoint4)
(can_traverse rover0 waypoint4 waypoint2)
(can_traverse rover0 waypoint2 waypoint4)
(can_traverse rover0 waypoint4 waypoint5)
(can_traverse rover0 waypoint5 waypoint4)
(can_traverse rover0 waypoint4 waypoint8)
(can_traverse rover0 waypoint8 waypoint4)
(can_traverse rover0 waypoint0 waypoint6)
(can_traverse rover0 waypoint6 waypoint0)
(can_traverse rover0 waypoint0 waypoint7)
(can_traverse rover0 waypoint7 waypoint0)
(can_traverse rover0 waypoint2 waypoint1)
(can_traverse rover0 waypoint1 waypoint2)
(can_traverse rover0 waypoint6 waypoint3)
(can_traverse rover0 waypoint3 waypoint6)
(can_traverse rover0 waypoint6 waypoint9)
(can_traverse rover0 waypoint9 waypoint6)
(on_board camera0 rover0)
(calibration_target camera0 objective7)
(supports camera0 colour)
(on_board camera1 rover0)
(calibration_target camera1 objective2)
(supports camera1 colour)
(supports camera1 high_res)
(on_board camera2 rover0)
(calibration_target camera2 objective3)
(supports camera2 high_res)
(on_board camera3 rover0)
(calibration_target camera3 objective8)
(supports camera3 colour)
(supports camera3 high_res)
(on_board camera4 rover0)
(calibration_target camera4 objective6)
(supports camera4 colour)
(supports camera4 high_res)
(supports camera4 low_res)
(on_board camera5 rover0)
(calibration_target camera5 objective7)
(supports camera5 colour)
(supports camera5 high_res)
(supports camera5 low_res)
(on_board camera6 rover0)
(calibration_target camera6 objective0)
(supports camera6 low_res)
(on_board camera7 rover0)
(calibration_target camera7 objective1)
(supports camera7 colour)
(supports camera7 low_res)
(on_board camera8 rover0)
(calibration_target camera8 objective5)
(supports camera8 colour)
(supports camera8 low_res)
(visible_from objective0 waypoint0)
(visible_from objective0 waypoint2)
(visible_from objective0 waypoint4)
(visible_from objective0 waypoint5)
(visible_from objective0 waypoint9)
(visible_from objective1 waypoint2)
(visible_from objective1 waypoint3)
(visible_from objective1 waypoint5)
(visible_from objective1 waypoint6)
(visible_from objective1 waypoint7)
(visible_from objective1 waypoint8)
(visible_from objective2 waypoint4)
(visible_from objective2 waypoint6)
(visible_from objective3 waypoint0)
(visible_from objective3 waypoint2)
(visible_from objective3 waypoint4)
(visible_from objective4 waypoint4)
(visible_from objective4 waypoint7)
(visible_from objective4 waypoint8)
(visible_from objective4 waypoint9)
(visible_from objective5 waypoint0)
(visible_from objective5 waypoint1)
(visible_from objective5 waypoint2)
(visible_from objective5 waypoint4)
(visible_from objective5 waypoint8)
(visible_from objective5 waypoint9)
(visible_from objective6 waypoint8)
(visible_from objective7 waypoint0)
(visible_from objective7 waypoint1)
(visible_from objective7 waypoint4)
(visible_from objective7 waypoint6)
(visible_from objective7 waypoint7)
(visible_from objective8 waypoint1)
(visible_from objective8 waypoint3)
(visible_from objective8 waypoint7)
(visible_from objective8 waypoint8)
(visible_from objective8 waypoint9)
(visible_from objective9 waypoint0)
(visible_from objective9 waypoint1)
(visible_from objective9 waypoint4)
(visible_from objective9 waypoint5)
(visible_from objective9 waypoint9)
(at_rock_sample waypoint0)
(at_soil_sample waypoint1)
(at_soil_sample waypoint3)
(at_soil_sample waypoint5)
(at_rock_sample waypoint8)
(at_rock_sample waypoint9)
(channel_free general)
(available rover0)
(empty rover0store)
(communicated_image_data objective7 colour)
(calibrated camera5 rover0)
(have_image rover0 objective7 colour)
(at rover0 waypoint9)
)

(:goal (and
(communicated_rock_data waypoint9)
(communicated_rock_data waypoint0)
(communicated_image_data objective0 colour)
(communicated_image_data objective7 colour)
(communicated_image_data objective4 high_res)
(communicated_image_data objective8 high_res)
	)
)
)

; plan
1. (take_image rover0 waypoint9 objective0 camera5 colour)
   deleted: (calibrated camera5 rover0)
   added: (have_image rover0 objective0 colour)
   goals met: 1 of 6
2. (calibrate rover0 camera3 objective8 waypoint9)
   added: (calibrated camera3 rover0)
   goals met: 1 of 6
3. (navigate rover0 waypoint9 waypoint6)
   deleted: (at rover0 waypoint9)
   added: (at rover0 waypoint6)
   goals met: 1 of 6
4. (communicate_image_data rover0 general objective0 colour waypoint6 waypoint5)
   added: (communicated_image_data objective0 colour)
   goals met: 2 of 6
5. (navigate rover0 waypoint6 waypoint9)
   deleted: (at rover0 waypoint6)
   added: (at rover0 waypoint9)
   goals met: 2 of 6
6. (take_image rover0 waypoint9 objective4 camera3 high_res)
   deleted: (calibrated camera3 rover0)
   added: (have_image rover0 objective4 high_res)
   goals met: 2 of 6
7. (calibrate rover0 camera3 objective8 waypoint9)
   added: (calibrated camera3 rover0)
   goals met: 2 of 6
8. (take_image rover0 waypoint9 objective8 camera3 high_res)
   deleted: (calibrated camera3 rover0)
   added: (have_image rover0 objective8 high_res)
   goals met: 2 of 6
9. (navigate rover0 waypoint9 waypoint6)
   deleted: (at rover0 waypoint9)
   added: (at rover0 waypoint6)
   goals met: 2 of 6
10. (communicate_image_data rover0 general objective8 high_res waypoint6 waypoint5)
   added: (communicated_image_data objective8 high_res)
   goals met: 3 of 6
11. (communicate_image_data rover0 general objective4 high_res waypoint6 waypoint5)
   added: (communicated_image_data objective4 high_res)
   goals met: 4 of 6
12. (navigate rover0 waypoint6 waypoint0)
   deleted: (at rover0 waypoint6)
   added: (at rover0 waypoint0)
   goals met: 4 of 6
13. (sample_rock rover0 rover0store waypoint0)
   deleted: (empty rover0store) (at_rock_sample waypoint0)
   added: (have_rock_analysis rover0 waypoint0) (full rover0store)
   goals met: 4 of 6
14. (navigate rover0 waypoint0 waypoint6)
   deleted: (at rover0 waypoint0)
   added: (at rover0 waypoint6)
   goals met: 4 of 6
15. (communicate_rock_data rover0 general waypoint0 waypoint6 waypoint5)
   added: (communicated_rock_data waypoint0)
   goals met: 5 of 6
16. (drop rover0 rover0store)
   deleted: (full rover0store)
   added: (empty rover0store)
   goals met: 5 of 6
17. (navigate rover0 waypoint6 waypoint9)
   deleted: (at rover0 waypoint6)
   added: (at rover0 waypoint9)
   goals met: 5 of 6
18. (sample_rock rover0 rover0store waypoint9)
   deleted: (empty rover0store) (at_rock_sample waypoint9)
   added: (have_rock_analysis rover0 waypoint9) (full rover0store)
   goals met: 5 of 6
19. (navigate rover0 waypoint9 waypoint6)
   deleted: (at rover0 waypoint9)
   added: (at rover0 waypoint6)
   goals met: 5 of 6
20. (communicate_rock_data rover0 general waypoint9 waypoint6 waypoint5)
   added: (communicated_rock_data waypoint9)
   goals met: 6 of 6
